airbnb/app/controllers/accomodations_controller.rb

  def create
    new_accomodation = Accomodation.create(accomodation_params)
---
INSERT INTO "accomodations" ("name", "location", "description", "status", "created_at", "updated_at", "host_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def find_accomodation_by_id
    @accomodation = Accomodation.find_by(id: params[:id])
---
SELECT  "accomodations".* FROM "accomodations" WHERE "accomodations"."id" IS NULL LIMIT $1  [["LIMIT", 1]]