app/controllers/hosts_controller.rb

  def create
    new_host = Host.create(host_params)
---
INSERT INTO "hosts" ("email", "password", "first_name", "location", "image_url", "created_at", "updated_at", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def find_host_by_id
    @host = Host.find_by(id: params[:id])
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]